export const DAMAGE_RELATED_SKILLS = [
    "攻撃", "見切り", "超会心", "弱点特効", "会心撃【属性】", "会心撃【特殊】",
    "属性変換", "属性吸収", "連撃", "攻勢", "挑戦者", "力の解放",
    "火属性攻撃強化", "水属性攻撃強化", "雷属性攻撃強化", "氷属性攻撃強化", "龍属性攻撃強化",
    "毒属性強化", "麻痺属性強化", "睡眠属性強化", "爆破属性強化",
    "匠", "剛刃研磨", "業物", "砥石使用高速化", "飛燕", "渾身", "逆恨み", "逆襲", "フルチャージ", "災禍転覆",
    "攻めの守勢", "抜刀術【技】", "抜刀術【力】", "チャージマスター", "集中", "高速変形",
    "砲術", "砲弾装填", "砲撃術", "弾導強化", "心眼", "鈍器使い",
    "特殊射撃強化", "散弾・剛射強化", "貫通弾・竜の一矢強化", "通常弾・通常矢強化", "連射強化", "フォースショット", "ファーストショット",
    "鎖刃刺撃", "巧撃", "急襲"
];
