export const MOTION_VALUES = {
  "gs": [
    {
      "name": "抜刀斬り/縦斬り",
      "mv": 81,
      "elem": 1,
      "partMod": 1
    },
    {
      "name": "溜め斬りⅠ",
      "mv": 106,
      "elem": 1.1,
      "partMod": 1
    },
    {
      "name": "溜め斬りⅡ",
      "mv": 136,
      "elem": 1.3,
      "partMod": 1
    },
    {
      "name": "溜め斬りⅢ",
      "mv": 176,
      "elem": 1.5,
      "partMod": 1.2
    },
    {
      "name": "強溜め斬りⅠ",
      "mv": 111,
      "elem": 1.4,
      "partMod": 1
    },
    {
      "name": "強溜め斬りⅡ",
      "mv": 144,
      "elem": 1.6,
      "partMod": 1
    },
    {
      "name": "強溜め斬りⅢ",
      "mv": 187,
      "elem": 1.8,
      "partMod": 1.2
    },
    {
      "name": "真・溜め斬りⅠ",
      "mv": [12, 112],
      "elem": [1, 2],
      "partMod": [0, 1]
    },
    {
      "name": "真・溜め斬りⅠ(強撃)",
      "mv": [12, 134],
      "elem": [1, 2],
      "partMod": [0, 1]
    },
    {
      "name": "真・溜め斬りⅡ",
      "mv": [14, 164],
      "elem": [1, 2.2],
      "partMod": [0, 1]
    },
    {
      "name": "真・溜め斬りⅡ(強撃)",
      "mv": [14, 199],
      "elem": [1, 2.2],
      "partMod": [0, 1]
    },
    {
      "name": "真・溜め斬りⅢ",
      "mv": [16, 209],
      "elem": [1, 2.5],
      "partMod": [0, 1.5]
    },
    {
      "name": "真・溜め斬りⅢ(強撃)",
      "mv": [16, 267],
      "elem": [1, 2.5],
      "partMod": [0, 1.5]
    },
    {
      "name": "薙ぎ払い",
      "mv": 42,
      "elem": 1,
      "partMod": 1
    },
    {
      "name": "強薙ぎ払い０",
      "mv": 74,
      "elem": 1.7,
      "partMod": 1
    },
    {
      "name": "強薙ぎ払いⅠ",
      "mv": 90,
      "elem": 1.7,
      "partMod": 1
    },
    {
      "name": "強薙ぎ払いⅡ",
      "mv": 108,
      "elem": 2,
      "partMod": 1
    },
    {
      "name": "強薙ぎ払いⅢ",
      "mv": 134,
      "elem": 2.2,
      "partMod": 1.2
    },
    {
      "name": "飛び込み薙ぎ払い０",
      "mv": 93,
      "elem": 1,
      "partMod": 1
    },
    {
      "name": "飛び込み薙ぎ払いⅠ",
      "mv": 111,
      "elem": 2,
      "partMod": 1
    },
    {
      "name": "飛び込み薙ぎ払いⅡ",
      "mv": 135,
      "elem": 2.5,
      "partMod": 1
    },
    {
      "name": "飛び込み薙ぎ払いⅢ",
      "mv": 167,
      "elem": 3.1,
      "partMod": 1.5
    },
    {
      "name": "斬り上げ",
      "mv": 38,
      "elem": 1,
      "partMod": 1
    },
    {
      "name": "相殺斬り上げ",
      "mv": 94,
      "elem": 1.1,
      "partMod": 1
    },
    {
      "name": "相殺斬り上げ2",
      "mv": 121,
      "elem": 1.2,
      "partMod": 1
    },
    {
      "name": "相殺斬り上げ3",
      "mv": 151,
      "elem": 1.3,
      "partMod": 1.2
    },
    {
      "name": "横殴り",
      "mv": 16,
      "elem": 1,
      "partMod": 1
    },
    {
      "name": "タックル０",
      "mv": 23,
      "elem": 1,
      "partMod": 1
    },
    {
      "name": "タックルⅠ",
      "mv": 26,
      "elem": 1,
      "partMod": 1
    },
    {
      "name": "タックルⅡ",
      "mv": 35,
      "elem": 1,
      "partMod": 1
    },
    {
      "name": "タックルⅢ",
      "mv": 48,
      "elem": 1,
      "partMod": 1
    },
    {
      "name": "キック",
      "mv": 0,
      "elem": 1,
      "partMod": 1
    },
    {
      "name": "ジャンプ斬り０",
      "mv": 48,
      "elem": 1,
      "partMod": 1
    },
    {
      "name": "ジャンプ斬りⅠ",
      "mv": 58,
      "elem": 1,
      "partMod": 1
    },
    {
      "name": "ジャンプ斬りⅡ",
      "mv": 69,
      "elem": 1,
      "partMod": 1
    },
    {
      "name": "ジャンプ斬りⅢ",
      "mv": 87,
      "elem": 1,
      "partMod": 1
    },
    {
      "name": "溜め斬り上げⅠ",
      "mv": 48,
      "elem": 1,
      "partMod": 1
    },
    {
      "name": "溜め斬り上げⅡ",
      "mv": 72,
      "elem": 1,
      "partMod": 1
    },
    {
      "name": "溜め斬り上げⅢ",
      "mv": 98,
      "elem": 1,
      "partMod": 1
    },
    {
      "name": "落下突きⅠ",
      "mv": 0,
      "elem": 1,
      "partMod": 1
    },
    {
      "name": "落下突きⅡ",
      "mv": 0,
      "elem": 1,
      "partMod": 1
    },
    {
      "name": "集中貫通斬り",
      "mv": 0,
      "elem": 1,
      "partMod": 1
    },
    {
      "name": "騎乗攻撃1",
      "mv": 15,
      "elem": 1,
      "partMod": 1
    },
    {
      "name": "騎乗攻撃2",
      "mv": 10,
      "elem": 1,
      "partMod": 1
    }
  ],
  "ls": [
    {
      "name": "モーション",
      "mv": 0,
      "elem": 1
    },
    {
      "name": "縦斬り",
      "mv": 24,
      "elem": 1
    },
    {
      "name": "縦斬り(2)",
      "mv": 18,
      "elem": 1
    },
    {
      "name": "逆袈裟斬り",
      "mv": 32,
      "elem": 1
    },
    {
      "name": "突き",
      "mv": 18,
      "elem": 1
    },
    {
      "name": "斬り上げ",
      "mv": 18,
      "elem": 1
    },
    {
      "name": "斬り下がり",
      "mv": 22,
      "elem": 1
    },
    {
      "name": "左右移動斬り",
      "mv": 22,
      "elem": 1
    },
    {
      "name": "気刃踏み込み斬り",
      "mv": 28,
      "elem": 1
    },
    {
      "name": "気刃斬りⅠ(ゲージ無し)",
      "mv": 14,
      "elem": 1
    },
    {
      "name": "気刃斬りⅠ",
      "mv": 31,
      "elem": 1
    },
    {
      "name": "気刃斬りⅡ",
      "mv": 30,
      "elem": 1
    },
    {
      "name": "気刃斬りⅡ(移動)",
      "mv": [14, 26],
      "elem": 1
    },
    {
      "name": "気刃斬りⅢ",
      "mv": [14, 19, 34],
      "elem": 1
    },
    {
      "name": "気刃大回転斬り",
      "mv": 38,
      "elem": 1
    },
    {
      "name": "気刃踏み込み斬り",
      "mv": 28,
      "elem": 1
    },
    {
      "name": "練気解放無双斬り",
      "mv": [5, 5, 5, 10, 10, 10, 15, 15, 15, 22, 22, 22, 35, 35, 35],
      "elem": 1
    },
    {
      "name": "居合抜刀斬り",
      "mv": [18, 13],
      "elem": 1
    },
    {
      "name": "居合抜刀気刃斬り",
      "mv": 17,
      "elem": 1
    },
    {
      "name": "居合抜刀気刃斬り白",
      "mv": 19,
      "elem": 1
    },
    {
      "name": "居合抜刀気刃斬り黄",
      "mv": 31,
      "elem": 1
    },
    {
      "name": "居合抜刀気刃斬り赤",
      "mv": 39,
      "elem": 1
    },
    {
      "name": "気刃兜割白",
      "mv": [15, 15, 15, 15, 15, 15, 15],
      "elem": 1
    },
    {
      "name": "気刃兜割黄",
      "mv": [20, 20, 20, 20, 20, 20, 20],
      "elem": 1
    },
    {
      "name": "気刃兜割赤",
      "mv": [23, 23, 23, 23, 23, 23, 23],
      "elem": 1
    },
    {
      "name": "見切り斬り",
      "mv": 11,
      "elem": 1
    },
    {
      "name": "見切り斬り・旋",
      "mv": [20, 12],
      "elem": 1
    },
    {
      "name": "赤刃斬りⅠ",
      "mv": [33, 16],
      "elem": 0.5
    },
    {
      "name": "赤刃斬りⅡ",
      "mv": [11, 22],
      "elem": 1.05
    },
    {
      "name": "赤刃斬りⅢ",
      "mv": [30, 18, 55],
      "elem": 1.1
    },
    {
      "name": "赤刃旋転斬",
      "mv": 60,
      "elem": 1
    },
    {
      "name": "気刃突き",
      "mv": 18,
      "elem": 1
    },
    {
      "name": "ジャンプ斬り",
      "mv": 18,
      "elem": 1
    },
    {
      "name": "ジャンプ斬り上げ",
      "mv": 20,
      "elem": 1
    },
    {
      "name": "ジャンプ気刃斬りⅠ(ゲージ無し)",
      "mv": 16,
      "elem": 1
    },
    {
      "name": "ジャンプ気刃斬りⅠ",
      "mv": 30,
      "elem": 1
    },
    {
      "name": "騎乗攻撃1",
      "mv": [15, 10],
      "elem": 1
    },
    {
      "name": "騎乗攻撃2",
      "mv": 20,
      "elem": 1
    },
    {
      "name": "下乗攻撃",
      "mv": [30, 15],
      "elem": 1
    }
  ],
  "sns": [
    {
      "name": "モーション",
      "mv": 0,
      "elem": 1
    },
    {
      "name": "突進斬り",
      "mv": 28,
      "elem": 1
    },
    {
      "name": "斬り下ろし",
      "mv": 19,
      "elem": 1.3
    },
    {
      "name": "横斬り",
      "mv": 18,
      "elem": 1.3
    },
    {
      "name": "斜め斬り上げ",
      "mv": 24,
      "elem": 1.3
    },
    {
      "name": "斜め斬り下ろし",
      "mv": 27,
      "elem": 1
    },
    {
      "name": "水平斬り",
      "mv": 27,
      "elem": 1.2
    },
    {
      "name": "斬り返し",
      "mv": 28,
      "elem": 1.2
    },
    {
      "name": "回転斬り上げ",
      "mv": 39,
      "elem": 1.2
    },
    {
      "name": "回転斬り",
      "mv": 41,
      "elem": 1
    },
    {
      "name": "溜め斬り落とし",
      "mv": [18, 28, 14, 14, 14, 14],
      "elem": [1, 1.2, 0.3]
    },
    {
      "name": "溜め斬り落とし(派生)",
      "mv": [18, 28, 28, 28, 28, 28],
      "elem": [1, 1.2, 0.3]
    },
    {
      "name": "斬り上げ",
      "mv": 18,
      "elem": 1
    },
    {
      "name": "盾攻撃",
      "mv": 16,
      "elem": 1
    },
    {
      "name": "バックナックル",
      "mv": 27,
      "elem": 1
    },
    {
      "name": "ハードバッシュ",
      "mv": 40,
      "elem": 1
    },
    {
      "name": "旋刈り",
      "mv": 65,
      "elem": 1
    },
    {
      "name": "溜め斬り",
      "mv": 40,
      "elem": 1
    },
    {
      "name": "駆け上がり斬り",
      "mv": 25,
      "elem": 1
    },
    {
      "name": "フォールバッシュ",
      "mv": [52, 47],
      "elem": 1
    },
    {
      "name": "飛び込み斬り",
      "mv": 30,
      "elem": 1
    },
    {
      "name": "ジャストラッシュ",
      "mv": [10, 15, 15, 20, 30, 25, 18, 18, 18],
      "elem": [0, 1, 1, 0, 1, 1]
    },
    {
      "name": "ジャストラッシュ(ジャスト)",
      "mv": [40, 40, 45, 60, 80, 25, 34, 34, 34],
      "elem": [0, 1.5, 1.5, 0, 1.5, 1, 1]
    },
    {
      "name": "ガード斬り",
      "mv": 14,
      "elem": 1
    },
    {
      "name": "滑り込み斬り",
      "mv": [10, 50],
      "elem": 1
    },
    {
      "name": "ジャンプ突進斬り",
      "mv": 18,
      "elem": 1
    },
    {
      "name": "ジャンプ斬り",
      "mv": 20,
      "elem": 1
    },
    {
      "name": "落下突き",
      "mv": 12,
      "elem": 0.3
    },
    {
      "name": "反撃斬り",
      "mv": 55,
      "elem": 1.5
    },
    {
      "name": "集中急所突き",
      "mv": [15, 15, 19, 19, 19],
      "elem": [1, 0.3]
    },
    {
      "name": "フォールスラッシュ",
      "mv": [15, 15, 20, 20, 20, 7],
      "elem": [1, 1, 0.3]
    },
    {
      "name": "バッシュアッパー",
      "mv": [15, 15, 20, 20],
      "elem": [1, 0]
    },
    {
      "name": "騎乗攻撃",
      "mv": [10, 10],
      "elem": 1
    },
    {
      "name": "下乗攻撃",
      "mv": 20,
      "elem": 1
    }
  ],
  "db": [
    {
      "name": "モーション",
      "mv": 0,
      "elem": 1
    },
    {
      "name": "二段斬り",
      "mv": [8, 10],
      "elem": [0.6, 0.6]
    },
    {
      "name": "二段斬り返し",
      "mv": [10, 10],
      "elem": [0.6, 0.6]
    },
    {
      "name": "車輪斬り",
      "mv": [6, 11, 11],
      "elem": [0.7, 0.7, 0.7]
    },
    {
      "name": "斬り払い",
      "mv": [3, 3, 6, 6],
      "elem": [0.6, 0.6]
    },
    {
      "name": "斬り上げ",
      "mv": 7,
      "elem": 0.6
    },
    {
      "name": "回転斬り",
      "mv": [14, 5, 6],
      "elem": [0.6, 0.6, 0.6]
    },
    {
      "name": "鬼人逆手斬り",
      "mv": 10,
      "elem": 0.6
    },
    {
      "name": "鬼人二段斬り",
      "mv": [14, 7],
      "elem": [0.6, 0.6]
    },
    {
      "name": "鬼人六段斬り",
      "mv": [13, 13, 9, 9, 18, 18],
      "elem": [0.6, 0.6, 0.6]
    },
    {
      "name": "鬼人突進連斬",
      "mv": [5, 5, 4, 4, 11, 11],
      "elem": [0.6, 0.6, 1]
    },
    {
      "name": "二回転斬り",
      "mv": [15, 6, 5],
      "elem": [1, 1, 1]
    },
    {
      "name": "乱舞",
      "mv": [18, 18, 6, 6, 10, 10, 4, 4, 20, 20, 11, 11, 16, 16, 6, 25, 22, 8, 5, 22, 5, 14, 18, 8, 18, 36, 36],
      "elem": [1, 0.8, 0.8, 0.8, 0.8, 0.8, 0.8, 1, 1, 0.8, 0.8, 0.8, 0.8, 0.8, 0.8, 0.8, 1, 1, 1]
    },
    {
      "name": "鬼人連斬Ⅰ",
      "mv": [15, 15, 15, 15],
      "elem": 1
    },
    {
      "name": "鬼人連斬Ⅱ",
      "mv": [6, 8, 18, 18],
      "elem": [0.6, 0.6, 0.8]
    },
    {
      "name": "鬼人ジャスト回避",
      "mv": [4, 4, 8, 8],
      "elem": [0.3, 0.6]
    },
    {
      "name": "スクリュースライサー",
      "mv": [3, 2, 10, 15, 10, 15],
      "elem": [0.3, 0.3, 0.6, 0.6, 0.6, 0.6]
    },
    {
      "name": "ジャンプ二段斬り",
      "mv": [12, 9],
      "elem": [0.6, 0.6]
    },
    {
      "name": "空中回転乱舞",
      "mv": [8, 8, 12, 12],
      "elem": [0.5, 0.7, 0.5, 0.7]
    },
    {
      "name": "空中回転乱舞・天",
      "mv": [12, 15, 10, 8, 12, 15, 10],
      "elem": [0.4, 0.4, 0.4, 0.4, 0.4, 0.4, 0.4]
    },
    {
      "name": "空中回転乱舞・天フィニッシュ",
      "mv": [20, 20, 12, 12, 8, 8],
      "elem": [1, 1, 0.7, 0.7, 0.7, 0.7]
    },
    {
      "name": "騎乗攻撃",
      "mv": [8, 10],
      "elem": [0.6, 0.6]
    },
    {
      "name": "下乗攻撃",
      "mv": [12, 8, 12, 8, 8, 14, 6, 8],
      "elem": [0.6, 0.6, 0.6, 0.6, 0.6, 0.6, 0.6, 0.6]
    }
  ],
  "hammer": [
    {
      "name": "モーション",
      "mv": 0,
      "elem": 1
    },
    {
      "name": "振り回し",
      "mv": 22,
      "elem": 1
    },
    {
      "name": "縦振りⅠ",
      "mv": 41,
      "elem": 1
    },
    {
      "name": "縦振りⅡ",
      "mv": 45,
      "elem": 1
    },
    {
      "name": "アッパー",
      "mv": 95,
      "elem": 1.3
    },
    {
      "name": "横振り",
      "mv": 23,
      "elem": 1
    },
    {
      "name": "叩きつけ1",
      "mv": 43,
      "elem": 1.1
    },
    {
      "name": "叩きつけ2",
      "mv": 48,
      "elem": 1.1
    },
    {
      "name": "叩きつけ3",
      "mv": 70,
      "elem": 1.1
    },
    {
      "name": "叩きつけ4",
      "mv": 90,
      "elem": 1.1
    },
    {
      "name": "叩きつけフィニッシュ",
      "mv": [28, 28, 130],
      "elem": [1.1, 1.1, 1.5]
    },
    {
      "name": "返し振り",
      "mv": 18,
      "elem": 1
    },
    {
      "name": "溜め返し振り",
      "mv": 55,
      "elem": 1
    },
    {
      "name": "回転攻撃",
      "mv": [23, 18, 18, 18, 18, 18, 18, 25],
      "elem": [2.5, 2.5, 1.5]
    },
    {
      "name": "回転横振り",
      "mv": 30,
      "elem": 1.5
    },
    {
      "name": "回転返し振り",
      "mv": 55,
      "elem": 1.5
    },
    {
      "name": "回転強アッパー",
      "mv": 100,
      "elem": 1.5
    },
    {
      "name": "溜め振り回し",
      "mv": 25,
      "elem": 1.1
    },
    {
      "name": "溜めアッパー",
      "mv": 70,
      "elem": 1.2
    },
    {
      "name": "溜め叩きつけ",
      "mv": [20, 130],
      "elem": [1, 1.5]
    },
    {
      "name": "集中殴打【震天】(傷無し)",
      "mv": 30,
      "elem": 1
    },
    {
      "name": "渾身溜めアッパー",
      "mv": 130,
      "elem": 1
    },
    {
      "name": "渾身溜め叩きつけ",
      "mv": [20, 20, 200],
      "elem": [1, 1, 1]
    },
    {
      "name": "ジャンプ叩きつけ",
      "mv": 37,
      "elem": 1
    },
    {
      "name": "ジャンプ溜め攻撃Ⅰ",
      "mv": 65,
      "elem": 1.1
    },
    {
      "name": "ジャンプ溜め攻撃Ⅱ",
      "mv": 70,
      "elem": 1.2
    },
    {
      "name": "ジャンプ溜め攻撃Ⅲ",
      "mv": 80,
      "elem": 1.5
    },
    {
      "name": "騎乗攻撃",
      "mv": [10, 10],
      "elem": 1
    },
    {
      "name": "下乗攻撃",
      "mv": [10, 10, 10, 37],
      "elem": 1
    }
  ],
  "hh": [
    {
      "name": "モーション",
      "mv": 0,
      "elem": 1
    },
    {
      "name": "前方攻撃",
      "mv": 32,
      "elem": 1
    },
    {
      "name": "左ぶん回し",
      "mv": 33,
      "elem": 1
    },
    {
      "name": "右ぶん回し",
      "mv": 33,
      "elem": 1
    },
    {
      "name": "後方攻撃",
      "mv": 46,
      "elem": 1
    },
    {
      "name": "叩きつけ",
      "mv": [14, 42],
      "elem": 1
    },
    {
      "name": "叩きつけ・追撃",
      "mv": 65,
      "elem": 1
    },
    {
      "name": "連音攻撃",
      "mv": [15, 25],
      "elem": 1
    },
    {
      "name": "柄攻撃",
      "mv": 10,
      "elem": 1
    },
    {
      "name": "演奏",
      "mv": 35,
      "elem": 1
    },
    {
      "name": "演奏衝撃波",
      "mv": 27,
      "elem": 1
    },
    {
      "name": "奏撃1(ジャスト)",
      "mv": 3340,
      "elem": 1
    },
    {
      "name": "奏撃2(ジャスト)",
      "mv": 3550,
      "elem": 1
    },
    {
      "name": "重ね掛け(ジャスト)",
      "mv": [20, 6075],
      "elem": 1
    },
    {
      "name": "相殺の調べ",
      "mv": 75,
      "elem": 1
    },
    {
      "name": "響周波【打】",
      "mv": 0,
      "elem": 1
    },
    {
      "name": "重ね掛け響周波【打】2",
      "mv": 0,
      "elem": 1
    },
    {
      "name": "重ね掛け響周波【打】3",
      "mv": 0,
      "elem": 1
    },
    {
      "name": "響周波【斬】",
      "mv": 0,
      "elem": 1
    },
    {
      "name": "重ね掛け響周波【斬】2",
      "mv": 0,
      "elem": 1
    },
    {
      "name": "重ね掛け響周波【斬】3",
      "mv": 0,
      "elem": 1
    },
    {
      "name": "響周波【火】【水】【雷】【氷】【龍】【毒】【麻痺】【睡眠】【爆破】",
      "mv": 0,
      "elem": 1
    },
    {
      "name": "重ね掛け響周波【火】【水】【雷】【氷】【龍】【毒】【麻痺】【睡眠】【爆破】2",
      "mv": 0,
      "elem": 1
    },
    {
      "name": "重ね掛け響周波【火】【水】【雷】【氷】【龍】【毒】【麻痺】【睡眠】【爆破】3",
      "mv": 0,
      "elem": 1
    },
    {
      "name": "響玉設置",
      "mv": 0,
      "elem": 0.3
    },
    {
      "name": "響玉(追撃)",
      "mv": 0,
      "elem": 0.3
    },
    {
      "name": "集中音撃【残響】",
      "mv": 0,
      "elem": 1
    },
    {
      "name": "高周波",
      "mv": 0,
      "elem": 1
    },
    {
      "name": "ジャンプ叩きつけ",
      "mv": 35,
      "elem": 1
    },
    {
      "name": "騎乗攻撃1",
      "mv": 20,
      "elem": 1
    },
    {
      "name": "騎乗攻撃2",
      "mv": 30,
      "elem": 1
    },
    {
      "name": "下乗攻撃",
      "mv": 45,
      "elem": 1
    }
  ],
  "lance": [
    {
      "name": "モーション",
      "mv": 0,
      "elem": 1
    },
    {
      "name": "中段突きⅠ",
      "mv": 26,
      "elem": 1.2
    },
    {
      "name": "中段突きⅡ",
      "mv": 26,
      "elem": 1.2
    },
    {
      "name": "中段突きⅢ",
      "mv": 35,
      "elem": 1.4
    },
    {
      "name": "三段突き",
      "mv": [22, 22, 35],
      "elem": [1.3, 1.3, 1.5]
    },
    {
      "name": "上段突きⅠ",
      "mv": 31,
      "elem": 1
    },
    {
      "name": "上段突きⅡ",
      "mv": 31,
      "elem": 1
    },
    {
      "name": "上段突きⅢ",
      "mv": 42,
      "elem": 1
    },
    {
      "name": "なぎ払い",
      "mv": 80,
      "elem": 1
    },
    {
      "name": "飛び込み突き",
      "mv": [29, 29],
      "elem": 1.2
    },
    {
      "name": "ガード突き",
      "mv": 20,
      "elem": 1
    },
    {
      "name": "盾攻撃",
      "mv": 15,
      "elem": 1
    },
    {
      "name": "溜めカウンター",
      "mv": 43,
      "elem": 1
    },
    {
      "name": "カウンター二連突き",
      "mv": [33, 50],
      "elem": [1, 1]
    },
    {
      "name": "ガード(反撃)",
      "mv": 20,
      "elem": 1
    },
    {
      "name": "ジャストガード(反撃)",
      "mv": 25,
      "elem": 1
    },
    {
      "name": "返し突き",
      "mv": 24,
      "elem": 1.2
    },
    {
      "name": "返し突き(鍔迫り合い)",
      "mv": 31,
      "elem": 1
    },
    {
      "name": "大返し突き",
      "mv": [30, 25],
      "elem": [1, 1]
    },
    {
      "name": "大返し突き(鍔迫り合い)",
      "mv": [42, 25],
      "elem": [1, 1]
    },
    {
      "name": "渾身返し突き",
      "mv": [25, 30],
      "elem": [1, 1]
    },
    {
      "name": "渾身返し突き(鍔迫り合い)",
      "mv": [20, 58],
      "elem": [1, 1]
    },
    {
      "name": "渾身返し突き【穿】",
      "mv": [56, 20, 12],
      "elem": [1, 1, 1]
    },
    {
      "name": "突進",
      "mv": 17,
      "elem": 0.5
    },
    {
      "name": "フィニッシュ突き",
      "mv": 55,
      "elem": 1
    },
    {
      "name": "フィニッシュ二段突き",
      "mv": [35, 70],
      "elem": [1, 1]
    },
    {
      "name": "振り向き攻撃",
      "mv": 53,
      "elem": 1
    },
    {
      "name": "ジャンプ突き",
      "mv": 30,
      "elem": 1
    },
    {
      "name": "突進ジャンプ",
      "mv": 25,
      "elem": 0.5
    },
    {
      "name": "突進ジャンプ突き",
      "mv": 30,
      "elem": 0.5
    },
    {
      "name": "騎乗攻撃",
      "mv": 30,
      "elem": 1
    },
    {
      "name": "騎乗攻撃(突進)",
      "mv": 10,
      "elem": 1
    },
    {
      "name": "下乗攻撃",
      "mv": 20,
      "elem": 1
    }
  ],
  "gl": [
    {
      "name": "モーション",
      "mv": 0,
      "elem": 1
    },
    {
      "name": "踏み込み突き上げ",
      "mv": 38,
      "elem": 1
    },
    {
      "name": "水平突きⅠ",
      "mv": 24,
      "elem": 1
    },
    {
      "name": "水平突きⅡ",
      "mv": 24,
      "elem": 1
    },
    {
      "name": "なぎ払い",
      "mv": 40,
      "elem": 1.5
    },
    {
      "name": "斬り上げ",
      "mv": 38,
      "elem": 1
    },
    {
      "name": "叩きつけ",
      "mv": 57,
      "elem": 1
    },
    {
      "name": "移動なぎ払い",
      "mv": 40,
      "elem": 1.5
    },
    {
      "name": "ガード突き",
      "mv": 18,
      "elem": 1
    },
    {
      "name": "ジャンプ突き",
      "mv": 25,
      "elem": 1
    },
    {
      "name": "ジャンプ叩きつけ",
      "mv": 44,
      "elem": 1
    },
    {
      "name": "ジャンプ斬り上げ",
      "mv": 35,
      "elem": 1
    },
    {
      "name": "騎乗攻撃",
      "mv": 30,
      "elem": 1
    }
  ],
  "sa": [
    {
      "name": "モーション",
      "mv": 0,
      "elem": 1
    },
    {
      "name": "縦斬り(斧)",
      "mv": 45,
      "elem": 1
    },
    {
      "name": "横斬り",
      "mv": 23,
      "elem": 1
    },
    {
      "name": "螺旋充填斬り",
      "mv": [30, 41],
      "elem": [1, 1]
    },
    {
      "name": "突進斬り",
      "mv": 35,
      "elem": 1
    },
    {
      "name": "突進縦斬り",
      "mv": 45,
      "elem": 1
    },
    {
      "name": "斬り下がり",
      "mv": 42,
      "elem": 1
    },
    {
      "name": "振り回し(右)",
      "mv": 21,
      "elem": 1
    },
    {
      "name": "振り回し(左)",
      "mv": 23,
      "elem": 1
    },
    {
      "name": "強化叩きつけ",
      "mv": [15, 72],
      "elem": 1
    },
    {
      "name": "相殺斬り上げ",
      "mv": 50,
      "elem": 1
    },
    {
      "name": "変形斬り",
      "mv": 33,
      "elem": 1
    },
    {
      "name": "変形二連斬り",
      "mv": [30, 50],
      "elem": [1, 1]
    },
    {
      "name": "なぎ払い変形斬り",
      "mv": [20, 70, 35, 33],
      "elem": [1, 1, 1, 1]
    },
    {
      "name": "なぎ払い変形斬り(高出力)",
      "mv": [20, 70, 35, 33],
      "elem": [1, 1, 1, 1]
    },
    {
      "name": "追撃強化叩きつけ",
      "mv": [32, 90],
      "elem": [1, 1]
    },
    {
      "name": "追撃変形斬り",
      "mv": [123, 120],
      "elem": [1, 1]
    },
    {
      "name": "縦斬り(剣)",
      "mv": 33,
      "elem": 1
    },
    {
      "name": "右斬り上げ",
      "mv": 42,
      "elem": 1
    },
    {
      "name": "左斬り上げ",
      "mv": 48,
      "elem": 1
    },
    {
      "name": "二連斬り",
      "mv": [22, 26],
      "elem": 1
    },
    {
      "name": "三連斬り",
      "mv": [15, 22, 26],
      "elem": 1
    },
    {
      "name": "飛天連撃",
      "mv": [24, 36],
      "elem": 1
    },
    {
      "name": "属性解放フィニッシュ",
      "mv": [20, 12, 12, 12, 12, 12, 12, 12, 12, 135],
      "elem": [1, 0.7, 1]
    },
    {
      "name": "簡易属性解放フィニッシュ",
      "mv": [20, 12, 12, 12, 65],
      "elem": [1, 0.7, 1]
    },
    {
      "name": "圧縮解放斬り",
      "mv": [70, 17, 17, 17],
      "elem": [1, 1]
    },
    {
      "name": "零距離解放フィニッシュ",
      "mv": [20, 20, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 160],
      "elem": [1, 0.7, 1]
    },
    {
      "name": "簡易零距離解放フィニッシュ",
      "mv": [20, 20, 12, 12, 75],
      "elem": [1, 0.7, 1]
    },
    {
      "name": "カウンター斬り上げ",
      "mv": 28,
      "elem": 1
    },
    {
      "name": "フルリリーススラッシュ",
      "mv": [50, 20, 20, 20, 82, 35, 35, 35, 35, 35],
      "elem": [1, 1, 1, 1]
    },
    {
      "name": "変形斬り(斧)",
      "mv": 33,
      "elem": 1
    },
    {
      "name": "変形斬り(剣)",
      "mv": 45,
      "elem": 1
    },
    {
      "name": "変形斬り下がり",
      "mv": 45,
      "elem": 1
    },
    {
      "name": "変形二連斬り",
      "mv": [30, 50],
      "elem": [1, 1]
    },
    {
      "name": "斧集中変形連斬",
      "mv": 0,
      "elem": 1
    },
    {
      "name": "剣集中変形連斬",
      "mv": 0,
      "elem": 1
    },
    {
      "name": "高出力状態の追撃",
      "mv": 12,
      "elem": 1
    },
    {
      "name": "ジャンプ斬り(斧)",
      "mv": 45,
      "elem": 1
    },
    {
      "name": "ジャンプ斬り(剣)",
      "mv": 29,
      "elem": 1
    },
    {
      "name": "ジャンプ変形斬り(斧)",
      "mv": 29,
      "elem": 1
    },
    {
      "name": "ジャンプ変形斬り(剣)",
      "mv": 45,
      "elem": 1
    },
    {
      "name": "ジャンプなぎ払い",
      "mv": 45,
      "elem": 1
    },
    {
      "name": "騎乗攻撃1",
      "mv": 10,
      "elem": 1
    },
    {
      "name": "騎乗攻撃2",
      "mv": [10, 10, 10, 20],
      "elem": [1, 1, 1, 1]
    },
    {
      "name": "下乗攻撃",
      "mv": [10, 25],
      "elem": [1, 1]
    }
  ],
  "cb": [
    {
      "name": "モーション",
      "mv": 0,
      "elem": 1
    },
    {
      "name": "突進斬り(剣)",
      "mv": 18,
      "elem": 1
    },
    {
      "name": "牽制斬り",
      "mv": 12,
      "elem": 1
    },
    {
      "name": "斬り返し",
      "mv": 15,
      "elem": 1
    },
    {
      "name": "回転斬り",
      "mv": 30,
      "elem": 1
    },
    {
      "name": "溜め斬り上げ",
      "mv": 15,
      "elem": 1
    },
    {
      "name": "溜め二連斬り",
      "mv": [25, 16],
      "elem": [1, 1]
    },
    {
      "name": "盾突き",
      "mv": [12, 6],
      "elem": [1, 1]
    },
    {
      "name": "移動斬り",
      "mv": 24,
      "elem": 1
    },
    {
      "name": "高圧属性斬り",
      "mv": 48,
      "elem": 1
    },
    {
      "name": "変形斬り(剣)",
      "mv": 54,
      "elem": 1
    },
    {
      "name": "変形斬り(斧)",
      "mv": 30,
      "elem": 1
    },
    {
      "name": "突進叩きつけ",
      "mv": 48,
      "elem": 1
    },
    {
      "name": "斬り上げ",
      "mv": 38,
      "elem": 1
    },
    {
      "name": "縦斬り",
      "mv": 54,
      "elem": 1
    },
    {
      "name": "左右移動斬り",
      "mv": 42,
      "elem": 1
    },
    {
      "name": "後退斬り",
      "mv": 42,
      "elem": 1
    },
    {
      "name": "突進叩きつけ",
      "mv": 48,
      "elem": 1
    },
    {
      "name": "属性解放斬りⅠ",
      "mv": 53,
      "elem": 1
    },
    {
      "name": "属性解放斬りⅡ",
      "mv": [35, 58],
      "elem": 1
    },
    {
      "name": "斧強化の追撃",
      "mv": 14,
      "elem": 0.2
    },
    {
      "name": "高出力属性解放斬り",
      "mv": 65,
      "elem": 1
    },
    {
      "name": "超高出力属性解放斬り(ビンなし)",
      "mv": [12, 77],
      "elem": [1, 1]
    },
    {
      "name": "超高出力属性解放斬り",
      "mv": [12, 77, 36],
      "elem": [1, 1, 1]
    },
    {
      "name": "追撃高出力属性解放斬り",
      "mv": 72,
      "elem": 1
    },
    {
      "name": "属性強化回転斬り",
      "mv": 30,
      "elem": 1
    },
    {
      "name": "属性廻填斧強化斬り",
      "mv": 58,
      "elem": 1
    },
    {
      "name": "集中二連斬り",
      "mv": [15, 15],
      "elem": [1, 1]
    },
    {
      "name": "ジャンプ斬り(剣)",
      "mv": 22,
      "elem": 1
    },
    {
      "name": "ジャンプ斬り(斧)",
      "mv": 46,
      "elem": 1
    },
    {
      "name": "スライディング斬り",
      "mv": [12, 30],
      "elem": [1, 1]
    },
    {
      "name": "ジャンプ斬り上げ",
      "mv": 25,
      "elem": 1
    },
    {
      "name": "駆け上がり斬り下ろし",
      "mv": [15, 22],
      "elem": [1, 1]
    },
    {
      "name": "駆け上がり回転斬り",
      "mv": [20, 40],
      "elem": [1, 1]
    },
    {
      "name": "騎乗攻撃1",
      "mv": [12, 18],
      "elem": [1, 1]
    },
    {
      "name": "騎乗攻撃2",
      "mv": 24,
      "elem": 1
    },
    {
      "name": "下乗攻撃",
      "mv": [30, 12, 6],
      "elem": [1, 0.5, 0.5]
    }
  ],
  "ig": [
    {
      "name": "モーション",
      "mv": 0,
      "elem": 1
    },
    {
      "name": "飛び込み斬り",
      "mv": 28,
      "elem": 0.8
    },
    {
      "name": "連続斬り上げ",
      "mv": [20, 14],
      "elem": [0.7, 0.8]
    },
    {
      "name": "けさ斬り",
      "mv": 18,
      "elem": 0.8
    },
    {
      "name": "二段斬り",
      "mv": [18, 24],
      "elem": [0.7, 0.8]
    },
    {
      "name": "移動斬り",
      "mv": 24,
      "elem": 0.8
    },
    {
      "name": "移動連斬",
      "mv": [12, 11],
      "elem": [0.8, 0.8]
    },
    {
      "name": "なぎ払い",
      "mv": 22,
      "elem": 0.8
    },
    {
      "name": "叩きつけ",
      "mv": 26,
      "elem": 0.8
    },
    {
      "name": "回避斬り",
      "mv": 20,
      "elem": 0.8
    },
    {
      "name": "急襲斬り",
      "mv": [20, 12, 16, 32],
      "elem": [1, 1, 1, 1]
    },
    {
      "name": "急襲突き",
      "mv": [28, 5, 24],
      "elem": [1, 0, 1]
    },
    {
      "name": "駆け上がり二段斬り",
      "mv": [12, 20],
      "elem": [0.8, 0.8]
    },
    {
      "name": "ジャンプ斬り",
      "mv": 18,
      "elem": 1
    },
    {
      "name": "ジャンプ突進斬り",
      "mv": 26,
      "elem": 1
    },
    {
      "name": "操虫【印当て】",
      "mv": 5,
      "elem": 1
    },
    {
      "name": "操虫【エキス採取】",
      "mv": 0,
      "elem": 1
    },
    {
      "name": "強化連続斬り上げ",
      "mv": [24, 12, 24],
      "elem": [0.8, 0.8, 0.8]
    },
    {
      "name": "強化けさ斬り",
      "mv": [18, 28],
      "elem": [0.8, 0.8]
    },
    {
      "name": "強化二段斬り",
      "mv": [26, 18, 40],
      "elem": [0.6, 0.8, 1]
    },
    {
      "name": "飛円斬り",
      "mv": [22, 48],
      "elem": [1, 1]
    },
    {
      "name": "強化なぎ払い",
      "mv": [12, 24],
      "elem": [0.8, 0.8]
    },
    {
      "name": "強化急襲斬り",
      "mv": [32, 12, 18, 18, 18, 46],
      "elem": [1, 1, 1, 1, 1, 1]
    },
    {
      "name": "強化急襲突き",
      "mv": [28, 10, 5, 18, 18, 28],
      "elem": [1, 1, 1, 1, 1, 1]
    },
    {
      "name": "飛天螺旋斬",
      "mv": [64, 64, 64, 64, 64],
      "elem": 0.8
    },
    {
      "name": "集中転翔突き",
      "mv": 0,
      "elem": 1
    },
    {
      "name": "強化ジャンプ斬り",
      "mv": 14,
      "elem": 0.6
    },
    {
      "name": "強化ジャンプ突進斬り",
      "mv": [8, 8, 8, 8, 28],
      "elem": [0.5, 0.5, 0.5, 0.5, 1]
    },
    {
      "name": "騎乗攻撃1",
      "mv": [12, 5, 5, 10],
      "elem": 1
    },
    {
      "name": "騎乗攻撃2",
      "mv": [16, 16],
      "elem": [1, 1]
    },
    {
      "name": "下乗攻撃",
      "mv": [12, 8, 24],
      "elem": [1, 1, 1]
    }
  ],
  "bow": [
    {
      "name": "モーション",
      "mv": 0,
      "elem": 1
    },
    {
      "name": "クイックショット",
      "mv": [9, 9, 9],
      "elem": 0.4
    },
    {
      "name": "溜1",
      "mv": 10,
      "elem": 0.4
    },
    {
      "name": "溜2",
      "mv": [11, 11],
      "elem": 0.7
    },
    {
      "name": "溜3",
      "mv": [12, 12, 12],
      "elem": 1
    },
    {
      "name": "剛射1",
      "mv": [10, 10, 10],
      "elem": 0.4
    },
    {
      "name": "剛射2",
      "mv": [11, 11, 11, 11],
      "elem": 0.67
    },
    {
      "name": "剛射3",
      "mv": [12, 12, 12, 12, 12],
      "elem": 0.8
    },
    {
      "name": "剛連射1",
      "mv": [13, 13, 13, 13],
      "elem": 0.6
    },
    {
      "name": "剛連射2",
      "mv": [14, 14, 14, 14, 14],
      "elem": 0.87
    },
    {
      "name": "剛連射3",
      "mv": [15, 15, 15, 15, 15, 15],
      "elem": 1
    },
    {
      "name": "曲射1",
      "mv": [13, 13, 9, 9, 9, 9],
      "elem": [0, 0]
    },
    {
      "name": "曲射2",
      "mv": [13, 13, 13, 10, 10, 10, 10, 10],
      "elem": [0, 0]
    },
    {
      "name": "曲射3",
      "mv": [13, 13, 13, 13, 11, 11, 11, 11, 11, 11, 11],
      "elem": [0, 0]
    },
    {
      "name": "曲射1(炸裂)",
      "mv": 0,
      "elem": 1
    },
    {
      "name": "曲射2(炸裂)",
      "mv": 0,
      "elem": 1
    },
    {
      "name": "曲射3(炸裂)",
      "mv": 0,
      "elem": 1
    },
    {
      "name": "竜の一矢",
      "mv": 25,
      "elem": 0.3
    },
    {
      "name": "竜の一矢・刹那",
      "mv": 18,
      "elem": 0.3
    },
    {
      "name": "竜の千々矢",
      "mv": [25, 25, 25, 25, 25, 25],
      "elem": 0.5
    },
    {
      "name": "飛燕射ち1",
      "mv": [10, 10, 10],
      "elem": 0.4
    },
    {
      "name": "飛燕射ち2",
      "mv": [11, 11, 11, 11],
      "elem": 0.67
    },
    {
      "name": "飛燕射ち3",
      "mv": [12, 12, 12, 12, 12],
      "elem": 0.8
    },
    {
      "name": "駆け上がり射撃",
      "mv": [18, 18, 18, 18, 18, 18, 18],
      "elem": 0.5
    },
    {
      "name": "導ノ矢",
      "mv": 30,
      "elem": 1
    },
    {
      "name": "【導ノ矢】溜め",
      "mv": [13, 13, 13],
      "elem": 0.5
    },
    {
      "name": "【導ノ矢】クイックショット",
      "mv": [13, 13, 13],
      "elem": 0.8
    },
    {
      "name": "【導ノ矢】剛射",
      "mv": [13, 13, 13, 13, 13],
      "elem": 0.8
    },
    {
      "name": "【導ノ矢】剛連射",
      "mv": [16, 16, 16, 16, 16, 16],
      "elem": 0.65
    },
    {
      "name": "【導ノ矢】竜の一矢",
      "mv": 29,
      "elem": 0.5
    },
    {
      "name": "【導ノ矢】竜の一矢・刹那",
      "mv": 21,
      "elem": 0.5
    },
    {
      "name": "【導ノ矢】竜の千々矢",
      "mv": [28, 28, 28, 28, 28, 28],
      "elem": 0.5
    },
    {
      "name": "【導ノ矢】飛燕射ち",
      "mv": [13, 13, 13, 13, 13],
      "elem": 0.8
    },
    {
      "name": "【導ノ矢】駆け上がり射撃",
      "mv": [20, 20, 20, 20, 20, 20, 20],
      "elem": 0.5
    },
    {
      "name": "ジャンプ近接攻撃",
      "mv": 10,
      "elem": 1
    }
  ],
  "lbg": [
    {
      "name": "Lv1通常弾",
      "mv": 51,
      "elem": 1
    },
    {
      "name": "Lv2通常弾",
      "mv": 71.4,
      "elem": 1
    },
    {
      "name": "Lv3通常弾",
      "mv": 96.89999999999999,
      "elem": 1
    },
    {
      "name": "Lv1貫通弾",
      "mv": 11,
      "elem": 1
    },
    {
      "name": "Lv2貫通弾",
      "mv": 12,
      "elem": 1
    },
    {
      "name": "Lv3貫通弾",
      "mv": 12,
      "elem": 1
    },
    {
      "name": "Lv1散弾",
      "mv": 65,
      "elem": 1
    },
    {
      "name": "Lv2散弾",
      "mv": 93.6,
      "elem": 1
    },
    {
      "name": "Lv3散弾",
      "mv": 127.39999999999999,
      "elem": 1
    },
    {
      "name": "滅龍弾",
      "mv": 20,
      "elem": 1
    },
    {
      "name": "状態異常弾",
      "mv": 1,
      "elem": 1
    },
    {
      "name": "起爆竜弾",
      "mv": 60,
      "elem": 1
    },
    {
      "name": "竜熱相殺弾",
      "mv": 30,
      "elem": 1
    },
    {
      "name": "竜熱機関竜弾",
      "mv": 400,
      "elem": 1
    },
    {
      "name": "竜熱擲弾",
      "mv": 16,
      "elem": 1
    },
    {
      "name": "集中特効弾【射鵰】",
      "mv": 30,
      "elem": 1
    },
    {
      "name": "集中特効弾【竜吼】",
      "mv": 40,
      "elem": 1
    },
    {
      "name": "ジャンプリロード(ライト)",
      "mv": 30,
      "elem": 1
    },
    {
      "name": "武器構えジャンプ(ライト)",
      "mv": 20,
      "elem": 1
    },
    {
      "name": "ジャンプリロード(ヘビィ)",
      "mv": 25,
      "elem": 1
    },
    {
      "name": "武器構えジャンプ(ヘビィ)",
      "mv": 30,
      "elem": 1
    }
  ],
  "hbg": [
    {
      "name": "Lv1通常弾",
      "mv": 51,
      "elem": 1
    },
    {
      "name": "Lv2通常弾",
      "mv": 71.4,
      "elem": 1
    },
    {
      "name": "Lv3通常弾",
      "mv": 96.89999999999999,
      "elem": 1
    },
    {
      "name": "Lv1貫通弾",
      "mv": 11,
      "elem": 1
    },
    {
      "name": "Lv2貫通弾",
      "mv": 12,
      "elem": 1
    },
    {
      "name": "Lv3貫通弾",
      "mv": 12,
      "elem": 1
    },
    {
      "name": "Lv1散弾",
      "mv": 65,
      "elem": 1
    },
    {
      "name": "Lv2散弾",
      "mv": 93.6,
      "elem": 1
    },
    {
      "name": "Lv3散弾",
      "mv": 127.39999999999999,
      "elem": 1
    },
    {
      "name": "滅龍弾",
      "mv": 20,
      "elem": 1
    },
    {
      "name": "状態異常弾",
      "mv": 1,
      "elem": 1
    },
    {
      "name": "起爆竜弾",
      "mv": 60,
      "elem": 1
    },
    {
      "name": "竜熱相殺弾",
      "mv": 30,
      "elem": 1
    },
    {
      "name": "竜熱機関竜弾",
      "mv": 400,
      "elem": 1
    },
    {
      "name": "竜熱擲弾",
      "mv": 16,
      "elem": 1
    },
    {
      "name": "集中特効弾【射鵰】",
      "mv": 30,
      "elem": 1
    },
    {
      "name": "集中特効弾【竜吼】",
      "mv": 40,
      "elem": 1
    },
    {
      "name": "ジャンプリロード(ライト)",
      "mv": 30,
      "elem": 1
    },
    {
      "name": "武器構えジャンプ(ライト)",
      "mv": 20,
      "elem": 1
    },
    {
      "name": "ジャンプリロード(ヘビィ)",
      "mv": 25,
      "elem": 1
    },
    {
      "name": "武器構えジャンプ(ヘビィ)",
      "mv": 30,
      "elem": 1
    }
  ]
};
